benchmarks/cospec_benchmark_results_20250527_091424_facebook/opt-6.7b_facebook/opt-125m_tp1_dtp1/colocation_consolidated_selective_tile_7_0_12_math500_output.txt
INFO 05-27 09:27:47 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='math500', dataset_path=None, max_concurrency=None, model='facebook/opt-6.7b', tokenizer=None, use_beam_search=False, duration_minutes=5.0, logprobs=None, request_rate=12.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.0, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Loaded 500 samples from cache from HuggingFaceH4/cache/math500_facebook/opt-6.7b.json
Split dataset into 50 test samples and 450 training samples
Temperature:  0.0
Running test split to train selective validator...
Checking server health at http://127.0.0.1:8000/health
Server is ready!
Don't need to train selective validator
Running full benchmark...
Checking server health at http://127.0.0.1:8000/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 12.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 5.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     3291      
Benchmark duration (s):                  300.24    
Total input tokens:                      237107    
Total generated tokens:                  721207    
Request throughput (req/s):              10.96     
Output token throughput (tok/s):         2402.09   
Total Token throughput (tok/s):          3191.81   
---------------Time to First Token----------------
Mean TTFT (ms):                          352.69    
Median TTFT (ms):                        352.95    
P99 TTFT (ms):                           710.98    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          55.35     
Median TPOT (ms):                        49.80     
P99 TPOT (ms):                           127.89    
---------------Inter-token Latency----------------
Mean ITL (ms):                           196.66    
Median ITL (ms):                         202.57    
P99 ITL (ms):                            456.35    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          10962.02  
Median E2EL (ms):                        8924.47   
P99 E2EL (ms):                           37084.09  
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 57.63     
Median Token Latency (ms):               51.61     
P99 Token Latency (ms):                  135.93    
==================================================